Config/InformationRegisters/УстановленныеКомплектыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеКомплектыОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзмененийHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Если Истина, то по умолчанию не будет установлен флаг в загрузке комплекта и не будет оповещать о новой версии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ВерсииУстановленныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииУстановленныхОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/УстановленныеКомплектыОтчетности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗарегистрироватьВерсиюКомплектаОтчетности(ИнформацияОКомплекте, ВидыОтчетов) Экспорт
	
	Если ИнформацияОКомплекте = Неопределено или Не ЗначениеЗаполнено(ИнформацияОКомплекте.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию(); // регистрация версий отчетов и комплекта
	
	Попытка
		// Регистрация текущей версии комплекта
		Запись = РегистрыСведений.УстановленныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторКомплекта = ИнформацияОКомплекте.Идентификатор;
		Запись.Наименование           = ИнформацияОКомплекте.Наименование;
		Запись.Описание               = ИнформацияОКомплекте.Описание;
		Запись.Поставщик              = ИнформацияОКомплекте.Поставщик;
		Запись.Версия                 = ИнформацияОКомплекте.Версия;
		Запись.НеИспользуется		  = ПолучитьПризнакНеИспользуетсяКомплекта(Запись.ИдентификаторКомплекта);
		
		Если ИнформацияОКомплекте.Свойство("ДопИнформация") Тогда
			
			Если ТипЗнч(ИнформацияОКомплекте.ДопИнформация) = Тип("ДокументDOM") Тогда
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьDOM = Новый ЗаписьDOM;
				ЗаписьXML.УстановитьСтроку();
				ЗаписьDOM.Записать(ИнформацияОКомплекте.ДопИнформация, ЗаписьXML);
				СтрокаXML = ЗаписьXML.Закрыть();
			Иначе
				СтрокаXML = ИнформацияОКомплекте.ДопИнформация;
			КонецЕсли;
			
			Запись.ОписаниеИзмененийHTML = Новый ХранилищеЗначения(СтрокаXML, Новый СжатиеДанных(9));
			
		КонецЕсли;
		
		Запись.Записать();
		
		// Регистрация изменений по видам отчета
		Если ЗначениеЗаполнено(ВидыОтчетов) Тогда  	
			Если ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.РегистрацияВерсийУстановленныхОтчетов") Тогда 
							
				Модуль = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрСведений.ВерсииУстановленныхОтчетов");
				Модуль.ЗарегистрироватьВерсииОтчетов(ВидыОтчетов,ИнформацияОКомплекте.Идентификатор, ИнформацияОКомплекте.Версия);
				
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПризнакНеИспользуетсяКомплекта(ИдентификаторКомплекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеКомплектыОтчетности.НеИспользуется КАК НеИспользуется
		|ИЗ
		|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
		|ГДЕ
		|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта = &ИдентификаторКомплекта";
	
	Запрос.УстановитьПараметр("ИдентификаторКомплекта", ИдентификаторКомплекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗначениеНеИспользуется = Ложь;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗначениеНеИспользуется = ВыборкаДетальныеЗаписи.НеИспользуется;
	КонецЕсли;
	
	Возврат ЗначениеНеИспользуется;
	
КонецФункции

#КонецЕсли
